[{"title":"Falcon 1 Makes History","details":"Falcon 1 becomes the first privately developed liquid fuel rocket to reach Earth orbit."},{"title":"SpaceX Wins $1.6B CRS Contract","details":"NASA awards SpaceX $1.6B Commercial Resupply Services (CRS) contract."},{"title":"Falcon 1 Flight 5 Makes History","details":"Falcon 1 Flight 5 makes history, becoming the first privately developed liquid fuel rocket to deliver a commercial satellite to Earth orbit."},{"title":"Falcon 9 First Flight","details":"Met 100% of mission objectives on the first flight!"},{"title":"Dragon Returns From Earth Orbit","details":"On December 8, 2010, Dragon became the first privately developed spacecraft in history to re-enter from low-Earth orbit."},{"title":"First Dragon Visit to Space Station","details":"Dragon becomes the first private spacecraft in history to visit the space station."},{"title":"Grasshopper Completes Half-Mile Flight","details":"The Grasshopper program finished with a 744m flight, hover, and landing."},{"title":"First Flight of Falcon 9 to GTO","details":"Falcon 9 reaches Geosynchronous Transfer Orbit"},{"title":"First Stage Landing","details":"Falcon 9 first stage successfully lands in Atlantic Ocean."},{"title":"Falcon 9 Reusable Test Vehicle Flies 1000M","details":"Vehicle completes highest leap to date, lands safely."},{"title":"SpaceX Awarded Commercial Crew Contract","details":"NASA awards $2.6 billion SpaceX contract to fly American astronauts."},{"title":"Drone Ship Landings","details":"SpaceX begins series of first stage landing attempts on an autonomous spaceport drone ship."},{"title":"Pad Abort Test","details":"Crew Dragon tests launch abort system, which can provide astronauts with escape capability all the way to orbit."},{"title":"First Land Landing","details":"On December 21, 2015, the Falcon 9 rocket delivered 11 communications satellites to orbit, and the first stage returned and landed at Landing Zone 1 -– the first-ever orbital class rocket landing."},{"title":"Droneship Landing","details":"On April 8, 2016, the Falcon 9 rocket launched the Dragon spacecraft to the International Space Station, and the first stage returned and landed on the Of Course I Still Love You droneship."},{"title":"First Reflight","details":"On March 30, 2017, SpaceX achieved the world's first reflight of an orbital class rocket. Following delivery of the payload, the Falcon 9 first stage returned to Earth for the second time."},{"title":"First Dragon Reflight","details":"This Dragon resupply mission represented the first reflight of a commercial spacecraft to and from the International Space Station."},{"title":"Falcon Heavy Test Flight","details":"Maiden flight of Falcon Heavy, using two recovered Falcon 9 cores as side boosters (from the Thaicom 8 and CRS-9 missions), as well as a modified Block 3 booster reinforced to endure the additional load from the two side boosters. The static fire test, held on January 24, was the first time 27 engines were tested together. The launch was a success, and the side boosters landed simultaneously at adjacent ground pads. Drone ship landing of the central core failed due to TEA–TEB chemical igniter running out, preventing two of its engines from restarting; the landing failure caused damage to the nearby drone ship. Final burn to heliocentric Mars–Earth orbit was performed after the second stage and payload cruised for 6 hours through the Van Allen belts. Later, Elon Musk tweeted that the third burn was successful, and JPL's HORIZONS system showed the second stage and payload in an orbit with an aphelion of 1.67 AU. The live webcast proved immensely popular, as it became the second most watched livestream ever on YouTube, reaching over 2.3 million concurrent views."},{"title":"First Block 5 Launch","details":"The Bangabandhu Satellite-1 mission served as the first flight of Falcon 9 Block 5, the final substantial upgrade to SpaceX’s Falcon 9 launch vehicle. Falcon 9 Block 5 is designed to be capable of 10 or more flights with very limited refurbishment as SpaceX continues to strive for rapid reusability and extremely high reliability."},{"title":"First Block 5 Reflight","details":"Indonesian comsat intended to replace the aging Telkom 1 at 108° E. First reflight of a Block 5-version booster."}]